app/controllers/galleries_controller.rb

  def index
    @galleries = Gallery.all
---
SELECT "galleries".* FROM "galleries"

  def create
    @gallery = Gallery.new(gallery_params)

    if @gallery.save
---
INSERT INTO "galleries" ("name", "city", "state", "zip", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "new gallery 2"], ["city", "wayne"], ["state", " pa"], ["zip", 19087], ["description", ""], ["created_at", 2017-03-02 20:59:27 UTC], ["updated_at", 2017-03-02 20:59:27 UTC]]

  def show
    @gallery = Gallery.find(params[:id])
---
SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]