app/controllers/paintings_controller.rb

SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @gallery = Gallery.find(params[:gallery_id])

SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "paintings" ("title", "artists", "gallery_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "A really great painting"], ["artists", "me"], ["gallery_id", 1]]
---
  def create
    @gallery = Gallery.find(params[:gallery_id])
    @painting = Painting.new(painting_params)
    @painting.gallery = @gallery
    if @painting.save